system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application pimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 1;

deltaT	1e-5;

writeControl    adjustableRunTime;

writeInterval 0.01;

purgeWrite 0;

writeFormat ascii;

writePrecision 12;

writeCompression no;

timeFormat general;

timePrecision 6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 5;

maxDeltaT    1e-4;

functions
{
	#includeFunc Q
	#include "forces"
	#include "AMIWeights"
	#includeFunc MachNo
	#includeFunc solverInfo
	yPlus
	{
		type yPlus;
		libs (fieldFunctionObjects);
		executeControl writeTime;
		writeControl writeTime;
		patches (propellerIn propellerOut wing);
	}
	wallShearStress1
	{
		type wallShearStress;
		libs ("libfieldFunctionObjects.so");
		patches (propeller wing);
		executeControl writeTime;
		writeControl writeTime;
	}
	lambda2
	{
		type            Lambda2;
		libs            ("libfieldFunctionObjects.so");
		executeControl  writeTime;
		writeControl    writeTime;
	}

	vorticity
	{
		type            vorticity;
		libs            ("libfieldFunctionObjects.so");
		executeControl  writeTime;
		writeControl    writeTime;
	}
} 	
// ************************************************************************* //

