system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices (
    (-4 -3 0) //0
    (8 -3 0) //1
    (8 3 0) //2
    (-4 3 0) //3
    (-4 -3 3) //4
    (8 -3 3) //5
    (8 3 3) //6
    (-4 3 3) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 30 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    farField
    {
        type patch;
        faces
        (
			(4 5 6 7)
            (3 7 6 2)
            (1 5 4 0)			
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
	symmetry
	{
	    type symmetryPlane;
        faces
        (
			(0 3 2 1)
        );
	}
);

mergePatchPairs
(
);


// ************************************************************************* //
