system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    propeller1.stl
    { 
		type triSurfaceMesh; 
		name propellerIn;
    }
    propeller2.stl
    { 
		type triSurfaceMesh; 
		name propellerOut;
    }

    ami1
    { 
		type searchableCylinder; 
		point1 (-0.09 0 0.54); 
		point2 (-0.03 0 0.54); 
		radius 0.25;
    }
    ami2
    { 
		type searchableCylinder; 
		point1 (-0.09 0 1.08); 
		point2 (-0.03 0 1.08); 
		radius 0.25;
    }

    wing.stl
    {
        type triSurfaceMesh;
        name wing;
    }

    box1
    {
        type box;
        min  (-1 -1 0);
        max  (8 1 2);
    }

    box2
    {
        type box;
        min  (-0.5 -0.5 0);
        max  (2.5 0.5 1.5);
    }
	
	box3
    {
        type box;
        min  (-0.085 -0.025 0.365);
        max  (-0.035 0.025 0.715);
    }

	box4
    {
        type box;
        min  (-0.085 -0.025 0.905);
        max  (-0.035 0.025 1.255);
    }
	
    propWake1
	{
		type searchableCone; 
		point1 (-0.03 0 0.54); 
		radius1 0.25;
		innerRadius1 0;
		point2 (1 0 0.54); 
		radius2 0.3;
		innerRadius1 0;
	}
    propWake2
	{
		type searchableCone; 
		point1 (-0.03 0 1.08); 
		radius1 0.25;
		innerRadius1 0;
		point2 (1 0 1.08); 
		radius2 0.3;
		innerRadius1 0;
	}
}

castellatedMeshControls
{
    maxLocalCells 8000000;
    maxGlobalCells 12000000;
    minRefinementCells 1;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 4;

    features
    (
	    { file "wing.eMesh"; level 7;}
        { file "propeller1.eMesh"; level 9;} 
        { file "propeller2.eMesh"; level 9;} 
    );

    refinementSurfaces
    {
        propellerIn
        { 
			level (8 9);
		    patchInfo
            {
                type wall;
                inGroups (propGroup);
            }
        } 
        propellerOut
        { 
			level (8 9);
		    patchInfo
            {
                type wall;
                inGroups (propGroup);
            }
        } 
        
		wing
        {
            level (6 7);
            patchInfo
            {
                type wall;
                inGroups (wingGroup);
            }
        }
        
        ami1
        {
			level (4 5);
			faceType    baffle;
			cellZone    rotor1;
			faceZone    ami1;
			cellZoneInside  inside;
        }
        ami2
        {
			level (4 5);
			faceType    baffle;
			cellZone    rotor2;
			faceZone    ami2;
			cellZoneInside  inside;
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
		ami1
        {
            mode        inside;
            levels      ((1E15 5));
        } 
		ami2
        {
            mode        inside;
            levels      ((1E15 5));
        } 
		box1
        {
            mode inside;
            levels ((1E15 1)); 
        }	
		box2
        {
            mode inside;
            levels ((1E15 3)); 
        }
		box3
        {
            mode inside;
            levels ((1E15 6)); 
        }
		box4
        {
            mode inside;
            levels ((1E15 6)); 
        }
        propWake1
        {
            mode inside;
            levels ((1E15 5)); 
        }
        propWake2
        {
            mode inside;
            levels ((1E15 5)); 
        }
    }
    locationInMesh (5 0 1.5);
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 8;
    tolerance 3;
    nSolveIter 100;
    nRelaxIter 6;
	concaveAngle 45;
    nFeatureSnapIter 20;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes false;

    layers
    {
		"propellerIn" 
        {
            nSurfaceLayers 5;
			expansionRatio 1.25;
			firstLayerThickness 1e-4;
        }
		"propellerOut" 
        {
            nSurfaceLayers 5;
			expansionRatio 1.25;
			firstLayerThickness 1e-4;
        }
		"wing" 
        {
            nSurfaceLayers 6;
			expansionRatio 1.25;
			firstLayerThickness 4.5e-4;
        }
    }

	firstLayerThickness 1e-4;
    expansionRatio 1.25;
    minThickness 1e-5;
	
    nGrow 0;
    featureAngle 130;
	slipFeatureAngle 30;
    nBufferCellsNoExtrude 0;
	
    nRelaxIter 10;
    nSmoothSurfaceNormals 5;
    nSmoothNormals 10;
    nSmoothThickness 15;
	nSmoothDisplacement 15;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 130;

    nLayerIter 200;
    nOuterIter 5;
	nRelaxedIter 20;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 4;
    maxInternalSkewness 2;
    maxConcave 60;
    minVol 1e-13;
	minTetQuality 1e-12;
    minArea -1;
    minTwist 0.02;
	minDeterminant 0.001;
	minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 10;
    errorReduction 0.9;
    relaxed
    {
        maxNonOrtho 75;
        maxConcave 70;
        maxBoundarySkewness 16;
		maxInternalSkewness 4;
		minTetQuality 1e-15;
		minDeterminant 1e-5;
        minVolRatio 0.005;
        minFaceWeight 0.01;
    }
}
debug 0;
mergeTolerance 1e-6;

// ************************************************************************* //
