constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs (fvMotionSolvers);

motionSolver    multiSolidBodyMotionSolver;//solidBody;//

rotor1
{
    cellZone        rotor1;
    solidBodyMotionFunction rotatingMotion;

    origin      (-0.05 0 0.54); 
    axis        (1 0 0);
    omega       table
    (
        (0 0)      
        (0.05 733.04)  
        (1 733.04)     
    );
}

rotor2
{
    cellZone        rotor2;
    solidBodyMotionFunction rotatingMotion;

    origin      (-0.05 0 1.08); 
    axis        (1 0 0);
    omega       table
    (
        (0 0)      
        (0.05 733.04)  
        (1 733.04)     
    );
}

predictorCorrector	true;
report	true;

// ************************************************************************* //


